csv data loading

In [14]:
import pandas as pd

In [15]:
orders_df = pd.read_csv("orders.csv")

In [16]:
orders_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

Json data loading

In [17]:
users_df = pd.read_json("users.json")

sql data loading

In [18]:
import sqlite3

In [19]:
conn = sqlite3.connect("restaurants.db")

In [20]:
with open("restaurants.sql", "r", encoding="utf-8") as f:
    sql_script = f.read()

In [21]:
conn.executescript(sql_script)

OperationalError: table restaurants already exists

In [22]:
restaurants_df = pd.read_sql("SELECT * FROM restaurants", conn)

conn.close()

merging the data

In [23]:
orders_users_df = orders_df.merge(
    users_df,
    on="user_id",
    how="left"
)

In [24]:
final_df = orders_users_df.merge(
    restaurants_df,
    on="restaurant_id",
    how="left"
)

In [25]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [26]:
output_df = pd.read_csv("final_food_delivery_dataset.csv")
output_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [27]:
df = output_df.copy()
df.rename(columns={
    "restaurant_name_x": "order_restaurant_name",
    "restaurant_name_y": "master_restaurant_name",
    "city": "user_city",
    "membership": "membership_type",
    "name": "user_name"
}, inplace=True)

In [28]:
df["order_date"] = pd.to_datetime(df["order_date"], format="%d-%m-%Y")
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,order_restaurant_name,user_name,user_city,membership_type,master_restaurant_name,cuisine,rating
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [29]:
total_rows = df['order_id'].count()
print(total_rows)

10000

In [30]:
(
    df[df["membership_type"] == "Gold"]
    .groupby("user_city")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)

user_city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [31]:
df.groupby("cuisine")["total_amount"].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [32]:
high_value_users = (
    df.groupby("user_id")["total_amount"].sum()
    .loc[lambda x: x > 1000]
    .count()
)

high_value_users

2544

In [33]:
df["rating_band"] = pd.cut(
    df["rating"],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0],
    labels=["3.0–3.5", "3.6–4.0", "4.1–4.5", "4.6–5.0"]
)

df.groupby("rating_band")["total_amount"].sum().sort_values(ascending=False)

C:\Users\VARUN\AppData\Local\Temp\ipykernel_16008\1690799433.py:7: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("rating_band")["total_amount"].sum().sort_values(ascending=False)

rating_band
4.6–5.0    2197030.75
4.1–4.5    1960326.26
3.0–3.5    1881754.57
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [34]:
(
    df[df["membership_type"] == "Gold"]
    .groupby("user_city")["total_amount"]
    .mean()
    .sort_values(ascending=False)
)

user_city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [35]:
cuisine_stats = df.groupby("cuisine").agg(
    restaurant_count=("restaurant_id", "nunique"),
    revenue=("total_amount", "sum")
)

cuisine_stats.sort_values(
    ["restaurant_count", "revenue"],
    ascending=[True, False]
)

         restaurant_count     revenue
cuisine
Chinese               120  1930504.65
Italian               126  2024203.80
Indian                126  1971412.58
Mexican               128  2085503.09

In [36]:
gold_pct = round(
    (df[df["membership_type"] == "Gold"].shape[0] / df.shape[0]) * 100
)

gold_pct

50

In [37]:
restaurant_perf = df.groupby("order_restaurant_name").agg(
    avg_order_value=("total_amount", "mean"),
    total_orders=("order_id", "count")
)

restaurant_perf[
    restaurant_perf["total_orders"] < 20
].sort_values("avg_order_value", ascending=False)

                                   avg_order_value  total_orders
order_restaurant_name
Hotel Dhaba Multicuisine               1040.222308            13
Sri Mess Punjabi                       1029.180833            12
Ruchi Biryani Punjabi                  1002.140625            16
Sri Delights Pure Veg                   989.467222            18
Classic Kitchen Family Restaurant       973.167895            19
...                                            ...           ...
Annapurna Tiffins Punjabi               621.828947            19
Darbar Tiffins Non-Veg                  596.815556            18
Darbar Restaurant Punjabi               589.972857            14
Spice Tiffins Pure Veg                  578.578667            15
Ruchi Mess Punjabi                      572.686471            17

[170 rows x 2 columns]

In [38]:
combo_revenue = (
    df.assign(combo=df["membership_type"] + " + " + df["cuisine"])
      .groupby("combo")["total_amount"]
      .sum()
      .sort_values(ascending=False)
)

combo_revenue

combo
Regular + Mexican    1072943.30
Regular + Italian    1018424.75
Gold + Mexican       1012559.79
Gold + Italian       1005779.05
Regular + Indian      992100.27
Gold + Indian         979312.31
Gold + Chinese        977713.74
Regular + Chinese     952790.91
Name: total_amount, dtype: float64

In [39]:
quarter_revenue = (
    df.assign(quarter=df["order_date"].dt.quarter)
      .groupby("quarter")["total_amount"]
      .sum()
      .sort_values(ascending=False)
)

quarter_revenue

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64

In [40]:
gold_orders_count = df[df["membership_type"] == "Gold"].shape[0]
gold_orders_count

4987

In [41]:
hyderabad_revenue = round(
    df[df["user_city"] == "Hyderabad"]["total_amount"].sum()
)
hyderabad_revenue

1889367

In [42]:
distinct_users = df["user_id"].nunique()
distinct_users

2883

In [43]:
avg_gold_order_value = round(
    df[df["membership_type"] == "Gold"]["total_amount"].mean(), 2
)
avg_gold_order_value

797.15

In [44]:
high_rating_orders = df[df["rating"] >= 4.5].shape[0]
high_rating_orders

3374

In [45]:
gold_city_revenue = (
    df[df["membership_type"] == "Gold"]
    .groupby("user_city")["total_amount"]
    .sum()
)

top_gold_city = gold_city_revenue.idxmax()


orders_in_top_gold_city = df[
    (df["membership_type"] == "Gold") &
    (df["user_city"] == top_gold_city)
].shape[0]

orders_in_top_gold_city

1337